In [1]:
# import libraries

import pandas as pd
import numpy as np
from sklearn.metrics import f1_score
from sklearn.cross_validation import train_test_split

# read data

titanic_train = pd.read_csv('train.csv')
titanic_train ,titanic_test = train_test_split(titanic_train,test_size=0.25)

/home/sunit/anaconda2/lib/python2.7/site-packages/sklearn/cross_validation.py:41: DeprecationWarning: This module was deprecated in version 0.18 in favor of the model_selection module into which all the refactored classes and functions are moved. Also note that the interface of the new CV iterators are different from that of this module. This module will be removed in 0.20.
  "This module will be removed in 0.20.", DeprecationWarning)

In [2]:
# check train data

titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
760,761,0,3,"Garfirth, Mr. John",male,NaN,0,0,358585,14.5000,NaN,S
580,581,1,2,"Christy, Miss. Julie Rachel",female,25.0,1,1,237789,30.0000,NaN,S
818,819,0,3,"Holm, Mr. John Fredrik Alexander",male,43.0,0,0,C 7075,6.4500,NaN,S
714,715,0,2,"Greenberg, Mr. Samuel",male,52.0,0,0,250647,13.0000,NaN,S
680,681,0,3,"Peters, Miss. Katie",female,NaN,0,0,330935,8.1375,NaN,Q

In [3]:
# check test data

titanic_test.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
763,764,1,1,"Carter, Mrs. William Ernest (Lucile Polk)",female,36.0,1,2,113760,120.0000,B96 B98,S
571,572,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0,2,0,11769,51.4792,C101,S
480,481,0,3,"Goodwin, Master. Harold Victor",male,9.0,5,2,CA 2144,46.9000,NaN,S
372,373,0,3,"Beavan, Mr. William Thomas",male,19.0,0,0,323951,8.0500,NaN,S
777,778,1,3,"Emanuel, Miss. Virginia Ethel",female,5.0,0,0,364516,12.4750,NaN,S

In [4]:
# replace male and female with 1 and 2

titanic_train['Sex'] = titanic_train['Sex'].replace(['male'], 1)
titanic_train['Sex'] = titanic_train['Sex'].replace(['female'], 2)

In [5]:
titanic_test['Sex'] = titanic_test['Sex'].replace(['male'], 1)
titanic_test['Sex'] = titanic_test['Sex'].replace(['female'], 2)

In [6]:
titanic_test.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
763,764,1,1,"Carter, Mrs. William Ernest (Lucile Polk)",2,36.0,1,2,113760,120.0000,B96 B98,S
571,572,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",2,53.0,2,0,11769,51.4792,C101,S
480,481,0,3,"Goodwin, Master. Harold Victor",1,9.0,5,2,CA 2144,46.9000,NaN,S
372,373,0,3,"Beavan, Mr. William Thomas",1,19.0,0,0,323951,8.0500,NaN,S
777,778,1,3,"Emanuel, Miss. Virginia Ethel",2,5.0,0,0,364516,12.4750,NaN,S

In [7]:
titanic_train = titanic_train.drop(columns= ['Name', 'Cabin','Ticket','PassengerId'])
titanic_test = titanic_test.drop(columns= ['Name', 'Cabin','Ticket','PassengerId'])

In [8]:
titanic_test.head()

     Survived  Pclass  Sex   Age  SibSp  Parch      Fare Embarked
763         1       1    2  36.0      1      2  120.0000        S
571         1       1    2  53.0      2      0   51.4792        S
480         0       3    1   9.0      5      2   46.9000        S
372         0       3    1  19.0      0      0    8.0500        S
777         1       3    2   5.0      0      0   12.4750        S

In [9]:
titanic_train['Embarked'].unique()

array(['S', 'Q', 'C', nan], dtype=object)

In [10]:
titanic_train['Embarked'] = titanic_train['Embarked'].replace(['S'], 1.0)
titanic_train['Embarked'] = titanic_train['Embarked'].replace(['C'], 2.0)
titanic_train['Embarked'] = titanic_train['Embarked'].replace(['Q'], 3.0)
titanic_test['Embarked'] = titanic_test['Embarked'].replace(['S'], 1.0)
titanic_test['Embarked'] = titanic_test['Embarked'].replace(['C'], 2.0)
titanic_test['Embarked'] = titanic_test['Embarked'].replace(['Q'], 3.0)

In [11]:
titanic_train=titanic_train.fillna(titanic_train.mean())
titanic_test=titanic_test.fillna(titanic_test.mean())

In [12]:
titanic_test.shape

(223, 8)

In [13]:
titanic_X = titanic_train.iloc[:,1:].copy()
titanic_Y = titanic_train.iloc[:,0:1].copy()

In [14]:
titanic_X.shape

(668, 7)

In [15]:
intercept = np.ones((titanic_X.shape[0], 1))
titanic_X = np.concatenate((intercept, titanic_X), axis=1)
titanic_test_X = titanic_test.iloc[:,1:].copy()
titanic_test_Y = titanic_test.iloc[:,0:1].copy()
intercept_t = np.ones((titanic_test_X.shape[0], 1))
titanic_test_X = np.concatenate((intercept_t, titanic_test_X), axis=1)
print(intercept_t.shape)

(223, 1)

In [16]:
titanic_X.shape

(668, 8)

In [17]:
intercept_t.shape

(223, 1)

In [18]:
titanic_test_X.shape

(223, 8)

In [19]:
theta = np.zeros((titanic_X.shape[1]))
grad = np.zeros((titanic_X.shape[1]))
theta = theta.reshape(titanic_X.shape[1],1)

In [20]:
titanic_X.shape

(668, 8)

In [21]:
# define sigmoid function

def sigmoid(data_X,w):
    z = data_X.dot(w)
    s = 1.0/(1.0 + np.exp(-1.0 * z))
    return s

In [22]:
# define cost function 

def cost(y_est, data_Y):
    J = (1.0/(len(data_Y)))*(np.sum((data_Y.T.dot(np.log(y_est)))-((1.0-data_Y).T.dot(np.log(1.0-y_est)))))
    return J

In [23]:
# initialize parameters

alpha = 0.0001
tolerance = 0.00001
iters = 1
cost_t = 1000

In [24]:
# define grad

def gradient(y_est, data_Y, data_X):
    grad = (1.0/len(data_X))*((data_X).T.dot(y_est-data_Y))
    return grad

In [25]:
h = sigmoid(titanic_X,theta)
c = cost(h,titanic_Y)
grad = gradient(h, titanic_Y, titanic_X)

In [26]:
while True:
    h = sigmoid(titanic_X,theta)
    c = cost(h,titanic_Y)
    grad = gradient(h, titanic_Y, titanic_X)
    theta_new = theta - (alpha*grad)
    #Stop Condition
    if (abs(cost_t - c)< tolerance).bool():
    #if iters > 250:
        print "Converged."
        break
    #if iters%10 == 0:
    #     print iters, c
    iters = iters +1
    theta = theta_new
    cost_t = c

Converged.

In [27]:
def predict(w, x, y):
    h = sigmoid(x,w)
    return h
y = predict(theta_new, titanic_test_X , titanic_test_Y)
acc = np.around(y)-titanic_test_Y

In [28]:
print f1_score(titanic_test_Y.values,np.around(y))

0.3716814159292035

In [29]:
accuracy = 1-float(np.count_nonzero(np.around(acc)))/len(acc)

In [30]:
print accuracy

0.681614349776